#include <stdio.h>

main()
{
	printf("%010d\n",20);

	printf("%-10d\n",20);

	printf("%+010d\n",20);

	/* %0*3$d 转换为以第3个参数为宽度，以0来填充的整数 */
	printf("%0*3$d\n",20,30,40,50,60,70);
	printf("%0*6$d\n",20,30,40,50,60,70);

	/* %0*d  转换为以第1个参数为宽度，以0来填充的整数 */
	printf("%0*d\n",20,30,40,50,60,70);

	/* */
	printf("%020.3f\n",12345.6789,123456.789123);
	
	/* %0.*f 将第2个参数转换为以第1个参数为精度，以0来填充的浮点数 */
	printf("%0.*f\n",9,123.4567);

	/* %0.*2$f 将第1个参数转换为以第2个参数为精度，以0来填充的浮点数
		2可以用m来代替，表示以第m个参数为精度
	*/
	printf("%0.*2$f\n",125.123456,10,12,15,18);
	printf("%0.*4$f\n",125.123456789,10,12,15,18);

	/* %0.*2$d 将第1个参数转换为以第2个参数为精度，以0来填充的整数 */
	printf("%0.*2$d\n",125,10,12,15,18);

	printf("%0.*2$d\n",1234567,10,12,15,18);

	printf("%0.*4$d\n",7654321,10,12,15,18);


	/* %0.*d 将第2个参数转换为以第1个参数为精度，以0来填充的整数 */
	printf("%0.*d\n",9,12);

}
