#!/usr/bin/env perl

=comment
利用JSON::XS
把perl中的hash转换成json

把hash的周期确认协议转换成json
=cut
use strict;
use warnings;

use JSON::XS;
use Encode;
use Data::Dump;
use utf8;
binmode(STDOUT,":utf8");

my $href = {
   # 手续费-划付信息  
   hf     => {
       type   => '财务外付',         # 划付类型:         '财务外付|非财务外付'
   }, 

   round  => '四舍五入',             # 取整规则:  '向上|向下|四舍五入'

   # 确认周期-时间区间 
   period => [
       1 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-06-07',  # 确认区间-起始日期
           end     => '2013-06-30',  # 确认区间-截止日期

           ceiling => 533339,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 533339,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间1

       2 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-07-01',  # 确认区间-起始日期
           end     => '2013-07-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间2
        
       3 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-08-01',  # 确认区间-起始日期
           end     => '2013-08-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间3 
        
       4 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-09-01',  # 确认区间-起始日期
           end     => '2013-09-30',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间4 
        
       5 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-10-01',  # 确认区间-起始日期
           end     => '2013-10-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间5 
        
       6 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-11-01',  # 确认区间-起始日期
           end     => '2013-11-30',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间6
       
       7 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2013-12-01',  # 确认区间-起始日期
           end     => '2013-12-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间7

       8 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-01-01',  # 确认区间-起始日期
           end     => '2014-01-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间8

       9 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-02-01',  # 确认区间-起始日期
           end     => '2014-02-28',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间9

       10 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-03-01',  # 确认区间-起始日期
           end     => '2014-03-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间10

       11 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-04-01',  # 确认区间-起始日期
           end     => '2014-04-30',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间11

       12 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-05-01',  # 确认区间-起始日期
           end     => '2014-05-31',  # 确认区间-截止日期

           ceiling => 666666,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 666666,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间12  
       
       13 => {
           type   => '定额',         # 包周期(月|季|半年|年): 1-定额; 2-阶梯; 3-分段

           begin   => '2014-06-01',  # 确认区间-起始日期
           end     => '2014-06-06',  # 确认区间-截止日期

           ceiling => 133335,              # 单位(分), 如果是定额: ceiling = floor 
           floor   => 133335,              # 单位(分)

           # 确认计算规则
           sect    => [
               {
                   begin => 0,    # '暂估手续费起始',
                   end   => 999999999999999999,  # '暂估手续费结束',
                   ratio => 100000000,    # 打折比列: 百万分之
               },
           ],
       },  # 日期区间13     
   ],
};

my $json = JSON::XS->new->utf8->encode($href);

warn "$json";
